# Install Cask
tap 'caskroom/cask'

brew 'ack'
brew 'autoconf'
brew 'autojump'
brew 'automake'
brew 'cctools'
brew 'cscope'
brew 'ctags'
brew 'docker'
brew 'docker-machine'
brew 'freetype'
brew 'gdbm'
brew 'git'
brew 'git-flow'
brew 'git-lfs'
brew 'graphviz'
brew 'imagemagick'
brew 'jpeg'
brew 'libevent'
brew 'libgpg-error'
brew 'libksba'
brew 'libpng'
brew 'libtiff'
brew 'libtool'
brew 'libyaml'
brew 'mackup'
brew 'macvim'
brew 'makedepend'
brew 'memcached'
brew 'mercurial'
brew 'openssl'
brew 'pcre'
brew 'pkg-config'
brew 'postgresql'
brew 'python'
brew 'python3'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 's3cmd'
brew 'sqlite'
brew 'terminal-notifier'
brew 'tmate'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'mercurial'
brew 'xz'
brew 'zsh'
brew 'zsh-completions'
brew 'nvm'
brew 'imagemagick'
brew 'gpg'
brew 'npm'

# mysql
#brew 'homebrew/versions/mysql56'

#java
#brew 'Caskroom/cask/java'

# ES 1.7
#brew 'homebrew/versions/elasticsearch17'
#brew 'elasticsearch'

cask 'caffeine'
cask 'spectacle'
cask 'alfred'
cask 'dropbox'
cask 'vlc'
cask 'adobe-reader'
cask 'google-chrome'
cask 'skype'
cask 'utorrent'
cask 'postgres'
cask 'megasync'
cask 'spotify'
cask 'dockertoolbox'
cask 'virtualbox'
cask 'kdiff3'
cask 'android-file-transfer'
cask 'iterm2'
cask 'slack'
cask 'gitter'
cask 'goofy'
